In [5]:
import pandas as pd
#series - 1 dim array-like object
obj = pd.Series([3,7,-5,3])
obj

0    3
1    7
2   -5
3    3
dtype: int64

In [6]:
#get the values from the object
obj.values

array([ 3,  7, -5,  3], dtype=int64)

In [10]:
#create a series with a defined index
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

#get a value by index
obj2['a']

-5

In [12]:
#filtering and sorting preserves the index relationship - like a dict
obj2[obj2 > 0]

d    4
b    7
c    3
dtype: int64

In [15]:
#can function like a dict, and a dict can be converted to a series
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [19]:
#make a list of states
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)

#California will have a NaN for missing data
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [22]:
#look for nulls
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [24]:
#do it directly with the series object
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [26]:
#auto aligns different series for math, based on index
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [28]:
#can give the series  and index names
obj4.name = 'population'
obj4.index.name = 'state'

obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [30]:
#Series index can be altered in place
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      3
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [34]:
#dataframes - spreadsheet like tabular data with row and column index
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = pd.DataFrame(data)
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [37]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [38]:
#dataframes with nulls will have NaN
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                   index=['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [39]:
#retieve a column
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [40]:
#retrieve a column another way
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [43]:
#retrieve a row by location index (hm, deprecated)
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [48]:

#column values can be modified
frame2['debt'] = 16.5

frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [51]:
#using series to assign data, filling missing values
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [55]:
#create a new column based off another
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [56]:
#delete it
del frame2['eastern']
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [58]:
# nested dicts can also be turned into frames
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [59]:
#transpose the result (pivot)
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [61]:
#dicts of series treated much the same way
pdata = {'Ohio': frame3['Ohio'][:-1],
          'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [65]:
#index objects hold the axis labels
obj = pd.Series(range(3), index=['a', 'b', 'c'])
index = obj.index
index
index[1]

'b'

In [67]:
#index objects are immutable
index[1] = 'd'

TypeError: Index does not support mutable operations

In [72]:
#indexes can be safely shared among objects
index = pd.Index(np.arange(3))

obj2 = pd.Series([1.5, -2.5, 0], index=index)
obj2.index is index

True

In [74]:
#reindexing - making a new object with the data conformed to a new index
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [75]:
#use the method option to fill in missing data
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3.reindex(range(6), method='ffill') #ffill means to carry missing objects forward, bfill would carry objects back

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [77]:
#reindexing a dataframe by row
frame = pd.DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],
                    columns=['Ohio', 'Texas', 'California'])
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [80]:
#reindex by column
states = ['California','Texas', 'Utah']
frame.reindex(columns = states)

   California  Texas  Utah
a           2      1   NaN
c           5      4   NaN
d           8      7   NaN

In [82]:
#do both at once (using ffill throws an error here)
frame.reindex(index=['a', 'b', 'c', 'd'], 
               columns=states)

   California  Texas  Utah
a         2.0    1.0   NaN
b         NaN    NaN   NaN
c         5.0    4.0   NaN
d         8.0    7.0   NaN

In [87]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],
                 columns=['Ohio', 'Texas', 'California'])
states = ['California', 'Texas', 'Utah']
frame.reindex(index=['a', 'b', 'c', 'd'],  columns=states)

   California  Texas  Utah
a         2.0    1.0   NaN
b         NaN    NaN   NaN
c         5.0    4.0   NaN
d         8.0    7.0   NaN

In [89]:
#use drop to drop part of a series
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [90]:
#drop multiples
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [91]:
#indexes can be dropped from either rows or columns in a dataframe
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                     columns=['one', 'two', 'three', 'four'])

data.drop(['Colorado'])

          one  two  three  four
Ohio        0    1      2     3
Utah        8    9     10    11
New York   12   13     14    15

In [93]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [94]:
#using index to select from series
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj['b']

1.0

In [95]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [96]:
#filtering works on values
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [97]:
#slicing with labels- endpoint is inclusive
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [99]:
#setting with labels
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [100]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                     index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [101]:
#indexing of dataframe
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [102]:
#selecting rows by boolean array
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [103]:
#can also select based on a boolean dataframe
#get a dataframe vector of all the less than 5's
data < 5
#convert all the less than 5 numbers to zeros
data[data < 5] = 0
#display
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [105]:
#get data by location index
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [108]:
import numpy as np
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])
np.abs(frame)

               b         d         e
Utah    0.065011  0.328106  1.246650
Ohio    0.740691  1.617576  0.489128
Texas   0.540743  1.023476  1.236613
Oregon  0.005857  0.537864  1.741778

In [109]:
#create a function
f = lambda x: x.max() - x.min()
#apply the function to the frame column-wise
frame.apply(f)

b    0.805702
d    2.155440
e    2.988427
dtype: float64

In [110]:
#apply row-wise
frame.apply(f, axis=1)

Utah      1.181639
Ohio      2.106704
Texas     0.695870
Oregon    2.279642
dtype: float64

In [111]:
#common methods don't need apply
frame.max()

b    0.740691
d    1.617576
e    1.741778
dtype: float64

In [113]:
#functions can return vectors
def f(x):  
    return pd.Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

            b         d         e
min -0.065011 -0.537864 -1.246650
max  0.740691  1.617576  1.741778

In [114]:
#apply functions using element wise mapping
format = lambda x: '%.2f' % x
frame.applymap(format)

            b      d      e
Utah    -0.07  -0.33  -1.25
Ohio     0.74   1.62  -0.49
Texas    0.54   1.02   1.24
Oregon  -0.01  -0.54   1.74

In [115]:
#built in map function does similar thing
frame['e'].map(format)

Utah      -1.25
Ohio      -0.49
Texas      1.24
Oregon     1.74
Name: e, dtype: object

In [117]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
   [np.nan, np.nan], [0.75, -1.3]],
   index=['a', 'b', 'c', 'd'],
   columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [118]:
#pandas summary statistics, automatically deal with missing values
df.sum()

one    9.25
two   -5.80
dtype: float64

In [119]:
#can do by row, too
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [120]:
#Na's can be brought back in by using skipna option
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [121]:
#get the index of the max value
df.idxmax()

one    b
two    d
dtype: object

In [122]:
#summary statistics
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [186]:
import pandas_datareader as pdr
import pandas

all_data = {}
for ticker in ['AAPL','MSFT']:
    all_data[ticker] = pdr.get_data_yahoo(ticker)

price = pandas.DataFrame({tic: data['Adj Close'] for tic, data in all_data.items()})
volume = pandas.DataFrame({tic: data['Volume'] for tic, data in all_data.items()})

returns = price.pct_change()
returns.tail()

                AAPL      MSFT
Date
2017-09-25 -0.008822 -0.015455
2017-09-26  0.017204  0.000000
2017-09-27  0.007118  0.008053
2017-09-28 -0.006160  0.000271
2017-10-02  0.003458  0.010018

In [187]:
returns.MSFT.corr(returns.AAPL)  # this is the same as returns.IBM.corr(returns.MSFT)

returns.corr()

         AAPL     MSFT
AAPL  1.00000  0.39491
MSFT  0.39491  1.00000

In [140]:
#get unique objects from a series
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [141]:
#get value counts of a series
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [143]:
#create a logical vector, for the values in another list
mask = obj.isin(['b', 'c'])
mask
#apply that vector, to only return values that match. This is which() from R.
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [144]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                   'Qu2': [2, 3, 1, 2, 3],
                  'Qu3': [1, 5, 2, 4, 4]})

data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [145]:
#passing value_counts to the dataframes apply lets you get counts for everything in the dataframe (good for histograms). It counts the row/column point
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [148]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [149]:
#filter out missing data
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [151]:
#by default, dropna drops any row with a missing value in a dataframe
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
         [NA, NA, NA], [NA, 6.5, 3.]])

cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [153]:
#passing how="all" drops only rows that are all na
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [154]:
#drop by column
data[4] = NA
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [156]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0  0.349331  0.720182 -0.947247
1  1.009122 -0.219856  1.139376
2 -0.959170 -2.231767  0.248527
3 -0.996828 -0.252083 -1.244534
4  1.017704 -3.515194  1.049306
5 -0.176028 -1.148643 -2.048349
6  0.034359 -0.776393 -0.788932

In [157]:
#add some NA
df.loc[:4,1] = NA
df.loc[:2, 2] = NA
df

          0         1         2
0  0.349331       NaN       NaN
1  1.009122       NaN       NaN
2 -0.959170       NaN       NaN
3 -0.996828       NaN -1.244534
4  1.017704       NaN  1.049306
5 -0.176028 -1.148643 -2.048349
6  0.034359 -0.776393 -0.788932

In [159]:
#keep rows with at least two observations
df.dropna(thresh=2)

          0         1         2
3 -0.996828       NaN -1.244534
4  1.017704       NaN  1.049306
5 -0.176028 -1.148643 -2.048349
6  0.034359 -0.776393 -0.788932

In [160]:
#fill with a constant
df.fillna(0)

          0         1         2
0  0.349331  0.000000  0.000000
1  1.009122  0.000000  0.000000
2 -0.959170  0.000000  0.000000
3 -0.996828  0.000000 -1.244534
4  1.017704  0.000000  1.049306
5 -0.176028 -1.148643 -2.048349
6  0.034359 -0.776393 -0.788932

In [162]:
#fill na with a dict
df.fillna({1:.5, 3:-1})

          0         1         2
0  0.349331  0.500000       NaN
1  1.009122  0.500000       NaN
2 -0.959170  0.500000       NaN
3 -0.996828  0.500000 -1.244534
4  1.017704  0.500000  1.049306
5 -0.176028 -1.148643 -2.048349
6  0.034359 -0.776393 -0.788932

In [163]:
#forward fill
df.fillna(method='ffill')

          0         1         2
0  0.349331       NaN       NaN
1  1.009122       NaN       NaN
2 -0.959170       NaN       NaN
3 -0.996828       NaN -1.244534
4  1.017704       NaN  1.049306
5 -0.176028 -1.148643 -2.048349
6  0.034359 -0.776393 -0.788932

In [165]:
#back fill, with a limit
df.fillna(method="bfill", limit=2)

          0         1         2
0  0.349331       NaN       NaN
1  1.009122       NaN -1.244534
2 -0.959170       NaN -1.244534
3 -0.996828 -1.148643 -1.244534
4  1.017704 -1.148643  1.049306
5 -0.176028 -1.148643 -2.048349
6  0.034359 -0.776393 -0.788932

In [166]:
data = pd.Series([1., NA, 3.5, NA, 7])
#fill with a mean of the series
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [167]:
data = pd.DataFrame({'k1': ['one'] * 3 + ['two'] * 4,
                 'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [168]:
#get a vector of duplicates
data.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [169]:
#drop duplicates
data.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [171]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

In [172]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
3  two   3   3

In [173]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami',
                            'corned beef', 'Bacon', 'pastrami', 'honey ham',
                             'nova lox'],
                    'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [175]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

#convert each value to lowercase and map it to an animal
data['animal'] = data['food'].map(str.lower).map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [177]:
#do the above by passing a function
data['food'].map(lambda x: meat_to_animal[x.lower()])
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon